Repository: Priya0102/studentside
Catalog: Eshiksa/*.lproj/Localizable.strings
Languages: hi

# REMEMBER
source: Remember Me
hi: याद रखें

source: Logout
hi: लॉगआउट

source: Forgot Password?
hi: पासवर्ड भूल गया?

source: Dashboard
hi: डैशबोर्ड

source: Settings
hi: सेटिंग्स

# SELECT_SETTINGS
source: Select your settings
hi: अपनी सेटिंग्स का चयन करें

# CHOOSE_LANGUAGE
source: Select your language
hi: अपनी भाषा का चयन करें

# LANG_EN
source: English
hi: अंग्रेज़ी

# LANG_HI
source: Hindi
hi: हिंदी

# MY_PROFILE
source: Profile
hi: मेरा प्रोफाइल

source: My Contact Information
hi: मेरी संपर्क जानकारी

source: My Address Is
hi: मेरा पता है

source: Hi! i am
hi: नमस्ते! मैं हूँ

source: Student
hi: छात्र

source: Student Details
hi: छात्र विवरण

source: Fees
hi: शुल्क

source: Due Fees
hi: देय शुल्क

source: Pay Fees
hi: देय शुल्क

source: Paid Fees
hi: फीस का भुगतान

source: Transaction History
hi: लेन-देन इतिहास

source: Library
hi: पुस्तकालय

source: Hostel
hi: छात्रावास

source: Homework
hi: होमवर्क

source: Attendance
hi: उपस्थिति

source: Close
hi: बंद करे

source: Homework List
hi: होमवर्क सूची

source: Submitted Homework
hi: प्रस्तुत होमवर्क

source: Feedback
hi: प्रतिक्रिया

source: Feedback Forms List
hi: प्रतिक्रिया रूपों सूची

source: View Feedback
hi: प्रतिक्रिया देखें

source: HR
hi: मानव संसाधन

source: View Profile
hi: प्रोफ़ाइल

source: Request Leave
hi: अनुरोध छुट्टी

source: My Attendance
hi: मेरी उपस्थिति

source: Student Gate Pass
hi: छात्र गेट पास

source: Student Leave
hi: छात्र छुट्टी

source: Time Table
hi: टाइम टेबल

source: Reminder
hi: अनुस्मारक

source: Appointments
hi: नियुक्ति

source: Support Request
hi: समर्थन अनुरोध

source: Payment Mode
hi: भुगतान मोड

source: Select Payment Mode
hi: भुगतान पद्धति का चयन करें

# CHOOSE_PAYMENT_MODE
source: Choose your payment mode
hi: आपके भुगतान मोड चुनें

source: Net Banking
hi: नेट बैंकिंग

source: Service Charges
hi: सेवा प्रभार

source: INR
hi: भारतीय रुपया

source: Credit Card
hi: क्रेडिट कार्ड

source: Debit Card
hi: डेबिट कार्ड

# NO_DATA_FOUND_OOPS
source: OOPS
hi: ओह

# NO_DATA_FOUND_MSG1
source: No Record Found
hi: कोई डेटा नहीं मिला

# NO_DATA_FOUND_MSG2
source: Oh no! It seems that there is no data here! If you find something wrong here, please contact support!
hi: ! अरे नहीं,यह यहाँ कोई डाटा नहीं है.अगर आप को यहाँ कुछ गलत लगता है, तो समर्थन से संपर्क करें!

# LOGIN_MSG1
source: Please enter your login credentials below
hi: नीचे आपके लॉगिन क्रेडेंशियल दर्ज करें

# LOGIN_USERNAME
source: Username
hi: नाम

# LOGIN_PASSWORD
source: Password
hi: पासवर्ड

# LOGIN_USERNAME_REQUIRED
source: Username is required
hi: नाम की आवश्यकता है

# LOGIN_PASSWORD_REQUIRED
source: Password is required
hi: पासवर्ड की आवश्यकता है

source: LOGIN
hi: लॉगिन

source: Powered by
hi: द्वारा संचालित

source: Version
hi: संस्करण

# LOGGED_IN_USER_PROFILE
source: Logged In User's Profile
hi: उपयोगकर्ता के प्रोफ़ाइल में लॉग इन

source: My Room
hi: मेरा कमराे

source: Gallery
hi: गैलरी

source: Hostels
hi: हॉस्टल

source: My Reminders
hi: मेरे अनुस्मारक

source: Add Reminder
hi: अनुस्मारक जोड़ें

source: Navigation
hi: नेविगेशन

source: Reminder Date
hi: अनुस्मारक तिथि

source: Description
hi: विवरण

source: Title
hi: शीर्षक

source: Address details
hi: पते की जानकारी

source: Your Reminders
hi: अपने अनुस्मारक

# REMINDER_TITLE
source: Title
hi: शीर्षक

# REMINDER_CREATED_DATE
source: Created Date
hi: बनाया दिनांक

# REMINDER_REMINDER_DATE
source: Reminder Date
hi: अनुस्मारक तिथि

source: Timetable
hi: सारिणी

source: Teacher's Timetable
hi: शिक्षक की समय सारिणी

# ATTENDANCE_ATTENDANCE_REPORT
source: Attendance Report
hi: उपस्थिति रिपोर्ट

# ATTENDANCE_STUDENT_ATTENDANCE
source: Student Attendance
hi: छात्र उपस्थिति

# ATTENDANCE_ROLL_NO
source: Roll No
hi: अनुक्रमांकं

# ATTENDANCE_ATTENDANCE_IN_PERCENT
source: Attendance (In Percent)
hi: उपस्थिति (प्रतिशत में)

# ATTENDANCE_TOTAL_DAYS
source: Total Days
hi: कुल दिन

# ATTENDANCE_TOTAL_PRESENT_DAYS
source: Total Present Days
hi: कुल उपस्तिथ दिन

# BOOKS_LIBRARY
source: Library
hi: पुस्तकालय

# BOOKS_LIBRARY_BOOKS
source: Library Books
hi: लाइब्रेरी की किताबें

# BOOKS_CATEGORY
source: Category
hi: श्रेणी

# BOOKS_AUTHOR
source: Author
hi: लेखक

# BOOKS_EDITION
source: Edition
hi: संस्करण

# BOOKS_PUBLISHER
source: Publisher
hi: प्रकाशक

# BOOKS_NO_OF_BOOKS
source: No of books
hi: पुस्तकों की संख्या

# BOOKS_AVAILABLE
source: Available
hi: उपलब्ध

source: Subject
hi: पाठ्यक्रम

# SUBJECT_COURSE
source: Course
hi: पाठ्यक्रम

# SUBJECT_COURSE_SUBJECTS
source: Course Subjects
hi: पाठ्यक्रम विषयों

# PAID_FEES_FEES
source: Fees
hi: शुल्क

# PAID_FEES_TRANSACTION_HISTORY
source: Transaction History
hi: लेन-देन इतिहास

# PAID_FEES_DATE
source: Date
hi: तिथि

# PAID_FEES_MODE
source: Mode
hi: मोड

# PAID_FEES_STATUS
source: Status
hi: स्थिति

# PAID_FEES_PAID_AMNT
source: Paid Amount
hi: अदा की गई राशि

# PAID_FEES_FEES_AMNT
source: Fees Amount
hi: शुल्क राशि

source: Invoice
hi: रसीद

# MY_HOSTEL_MY_ROOM
source: My Room
hi: मेरा कमरा

# MY_HOSTEL_MY_ROOM_DETAILS
source: My Room Details
hi: मेरे कमरे विवरण

# MY_HOSTEL_HOSTEL
source: Hostel
hi: छात्रावास

# MY_HOSTEL_ROOM_NO
source: Room No
hi: कमरा संख्यां

# MY_HOSTEL_FLOOR
source: Floor
hi: मंजिल

# MY_HOSTEL_ALLOTTED_DATE
source: Allotted Date
hi: आवंटित तिथि

# HOSTEL_HOSTELS
source: Hostels
hi: छात्रावास

# HOSTEL_HOSTEL_DETAILS
source: Hostels Details
hi: छात्रावास विवरण

# HOSTEL_FLOORS
source: Floors
hi: मंजिलों

# HOMEWORK_HOMEWORK
source: Homework
hi: होमवर्क

# HOMEWORK_HOMEWORK_LIST
source: Homework List
hi: होमवर्क सूची

# HOMEWORK_COURSE
source: Course
hi: पाठ्यक्रम

# HOMEWORK_SUBJECT
source: Subject
hi: विषय

# HOMEWORK_SUBMISSION_DATE
source: Submission Date
hi: प्रस्तुत करने की तारीख

# HOMEWORK_DESCRIPTION
source: Description
hi: विवरण

# HOME_NAME
source: Name
hi: नाम

# HOME_GROUP
source: Group
hi: समूह

# HOME_MOBILE
source: Mobile
hi: मोबाइल

# HOME_EMAIL
source: Email
hi: ईमेल

# HOME_ADDRESS
source: Address
hi: पता

# GALLERY_GALLERY_FOLDERS
source: Gallery Folders
hi: गैलरी फ़ोल्डर

# GALLERY_GALLERY
source: Gallery
hi: गैलरी

source: Gallery Images
hi: गैलरी छवियाँ

source: Download Attachment
hi: अनुलग्नक डाउनलोड करें

# GALLERY_DOWNLOAD
source: Download
hi: डाउनलोड

# GALLERY_CLOSE
source: Close
hi: बंद

# GALLERY_CLICK_TO_DOWNLOAD
source: Click image to download
hi: डाउनलोड करने के लिए छवि पर क्लिक करें

# FEES_FEES
source: Fees
hi: फीस

# FEES_FEES_RECORDS
source: Fees Records
hi: फीस रिकॉर्ड्स

# FEES_PAY_DUE_FEES
source: Pay Due Fees
hi: वेतन के कारण फीस

# FEES_TRANSACTION_HISTORY
source: Transaction History
hi: लेन-देन इतिहास

# FEES_YOUR_DUE_FEES
source: Your Due Fees
hi: देय फीस

# FEES_AMOUNT
source: Amount
hi: राशि

# FEES_PAY_NOW
source: Pay Now
hi: भुगतान करें

# DETAIL_CLASS_ROLL_NO
source: Class Roll No
hi: कक्षा रोल नंबर

# DETAIL_STUDENT_NAME
source: Student Name
hi: छात्र का नाम

# DETAIL_ADMISSION_NO
source: Admission No
hi: प्रवेश संख्या

# SUPPORT_REQ_COURSE
source: Course
hi: पाठ्यक्रम

# SUPPORT_REQ_COURSE_SUBJECTS
source: Course Subjects
hi: पाठ्यक्रम विषयों

# SUPPORT_REQ_COURSE_FROM
source: From
hi: से

# SUPPORT_REQ_COURSE_DATE
source: Date
hi: तिथि

# SUPPORT_REQ_COURSE_TITLE
source: Title
hi: शीर्षक

source: Chat
hi: चैट

source: Take Attendance
hi: उपस्थिति लें

source: View Attendance
hi: देखें उपस्थिति

source: Admission No
hi: प्रवेश संख्या

source: Username
hi: उपयोगकर्ता नाम

source: First Name
hi: पहला नाम

source: Last Name
hi: उपनाम

source: Status
hi: स्थिति

source: Remark
hi: टिप्पणी

source: Course
hi: कोर्स

source: Batch
hi: जत्था

source: Department
hi: विभाग

source: Semester
hi: सेमेस्टर

source: Section
hi: अनुभाग

source: Group
hi: समूह

source: Lecture
hi: व्याख्यान

source: Date
hi: तारीख

source: Save
hi: सहेजें

source: Select Course
hi: कोर्स का चयन करें

source: Select Batch
hi: जत्था का चयन करें

source: Select Department
hi: विभाग का चयन करें

source: Select Semester
hi: सेमेस्टर का चयन करें

source: Select Section
hi: अनुभाग का चयन करें

source: Select Group
hi: समूह का चयन करें

source: Select Subject
hi: विषय का चयन करें

source: Select Lecture
hi: व्याख्यान का चयन करें

# SAVE_ATTENDANCE
source: POST ATTENDANCE
hi: पोस्ट उपस्थिति

source: REVIEW ATTENDANCE
hi: समीक्षा उपस्थिति

# SAVE_ATTENDANCE_SUCCESS_MSG
source: Attendance has been posted successfully.
hi: उपस्थिति को सफलतापूर्वक प्रस्तुत किया गया है.

# CIRCULAR
source: Circulars
hi: परिपत्र

source: Library Panel
hi: लाइब्रेरी पैनल

# LIBRARY_PANEL_SELECT_CATEGORY
source: Select Category
hi: श्रेणी का चयन करें

# LIBRARY_PANEL_VIEW_BOOKS
source: View Books
hi: देखें पुस्तकें

# LIBRARY_PANEL_MY_LOGS
source: My Logs
hi: मेरी लॉग

# LIBRARY_PANEL_BOOK_TYPES
source: Book Types
hi: पुस्तक के प्रकार

# LIBRARY_PANEL_TITLE
source: Title
hi: शीर्षक

# LIBRARY_PANEL_ISBN
source: ISBN
hi: आईएसबीएन

# LIBRARY_PANEL_AUTHORS
source: Authors
hi: लेखक

# LIBRARY_PANEL_EDITION
source: Edition
hi: संस्करण

# LIBRARY_PANEL_PUBLISHER
source: Publisher
hi: प्रकाशक

# LIBRARY_PANEL_NO_OF_BOOKS
source: No. of books
hi: पुस्तकों की संख्या

# LIBRARY_PANEL_AVAILABLE_BOOKS
source: Available books
hi: उपलब्ध पुस्तकों

# LIBRARY_PANEL_REQUEST
source: Request
hi: प्रार्थना

# LIBRARY_PANEL_STUDENT_NAME
source: Student Name
hi: छात्र का नाम

# LIBRARY_PANEL_ADMISSION_NO
source: Admission No.
hi: प्रवेश संख्या

# LIBRARY_PANEL_BOOK_NAME
source: Book Name
hi: किताब का नाम

# LIBRARY_PANEL_ISSUE_DATE
source: Issue Date
hi: जारी करने की तिथि

# LIBRARY_PANEL_DUE_DATE
source: Due Date
hi: नियत तारीख

# LIBRARY_PANEL_RENEW
source: Renew
hi: नवीकरण

# LIBRARY_PANEL_RENEW_DATE
source: Renew Date
hi: तिथि नवीनीकृत

# LIBRARY_PANEL_BOOK_RETURN
source: Book Return
hi: किताब वापस

# LIBRARY_PANEL_FINE_AMOUNT
source: Fine Amount
hi: जुर्माने की राशि

# LIBRARY_PANEL_TEXT_BOOKS
source: Text Book
hi: पाठ्य पुस्तक

# LIBRARY_PANEL_REFERENCE_BOOKS
source: Reference Book
hi: दिग्दर्शन पुस्तक

# LIBRARY_PANEL_GENERALS
source: General
hi: सामान्य

# LIBRARY_PANEL_NA
source: NA
hi: एनए

# LIBRARY_PANEL_FETCH_BOOKS
source: Get Books
hi: किताबें मिल

source: Transport Route
hi: परिवहन मार्ग

# TRANSPORT_ROUTE_ROUTE_NAME
source: Route Name
hi: मार्ग का नाम

# TRANSPORT_ROUTE_STOP_NAME
source: Stop Name
hi: बंद का नाम

# TRANSPORT_ROUTE_STOP_LANDMARK
source: Stop Landmark
hi: बंद करो पहचान

# TRANSPORT_ROUTE_FEE_AMOUNT
source: Fee Amount
hi: शुल्क राशि

source: Gatepass
hi: गेट पास

# REQUEST_GATEPASS
source: Request
hi: गेट पास का अनुरोध

# GATEPASS_REQUEST_GATEPASS
source: Request Gatepass
hi: गेट पास का अनुरोध

# GATEPASS_REQUESTED_GATEPASSS
source: Requested Gatepasses
hi: का अनुरोध गेट पास

source: Apply Leave
hi: अनुरोध छुट्टी

source: Leaves
hi: छुट्टी

# LEAVES_REQUEST_LEAVE
source: Request Leave
hi: अनुरोध छुट्टी

# LEAVES_REQUESTED_LEAVES
source: Requested Leaves
hi: का अनुरोध छुट्टी

# LEAVES_LEAVES_LOG
source: Leaves Log
hi: छुट्टी लॉग

# LEAVES_REQUEST_FOR_LEAVES
source: Request For Leaves
hi: छुट्टी के लिए अनुरोध

source: Reason
hi: कारण

# LEAVES_REASON
source: Reason
hi: कारण

source: From Date
hi: तारीख से

source: To Date
hi: तारीख तक

# LEAVES_FROM_DATE
source: From Date
hi: की तिथि से

# LEAVES_TO_DATE
source: To Date
hi: तारीख तक

source: Contact
hi: संपर्क नंबर

# LEAVES_CONTACT_NO
source: Contact No
hi: संपर्क नंबर

# LEAVES_REQUEST_NAME
source: Name
hi: नाम

# LEAVES_REQUEST_COURSE
source: Course
hi: कोर्स

# LEAVES_REQUEST_BATCH
source: Batch
hi: जत्था

# LEAVES_REQUEST_CONTACT_NO
source: Contact No
hi: संपर्क नंबर

# LEAVES_REQUEST_REASON
source: Reason
hi: कारण

# LEAVES_REQUEST_FROM
source: From
hi: से

# LEAVES_REQUEST_TO
source: To
hi: तक

# LEAVES_REQUEST_REQUEST_BY
source: Request By
hi: इसके द्वारा अनुरोध

# LEAVES_REQUEST_RESPONSE
source: Response
hi: प्रतिक्रिया

# LEAVES_REQUEST_REJECTED
source: Rejected
hi: अस्वीकृत

# LEAVES_REQUEST_PENDING
source: Pending
hi: अपूर्ण

# LEAVES_REQUEST_APPROVED
source: Approved
hi: अनुमोदित

source: Lectures
hi: व्याख्यान

# ROOM_REQUEST
source: Hostel Room Request
hi: होस्टल के कमरे का अनुरोध

# ROOM_EXITING_REQUEST
source: Hostel Exit Request
hi: छात्रावास से बाहर निकलने का अनुरोध

source: Room Change Request
hi: कमरा बदलने का अनुरोध

# REQ_NAME
source: Name
hi: नाम

# REQ_MOBILE
source: Mobile
hi: मोबाइल

# REQ_REMARK
source: Remark
hi: टिप्पणी

# REQ_REMARK_ADMIN
source: Admin Remark
hi: व्यवस्थापक टिप्पणी

# ROOM_HOSTEL_REMARK
source: Hostel Remark
hi: छात्रावास टिप्पणी

# ROOM_HOSTEL_DATE
source: Date
hi: तारीख

# ROOM_SAVE
source: Request
hi: प्रार्थना

source: Change Password
hi: पासवर्ड बदलें

source: Password
hi: पासवर्ड

source: Confirm Password
hi: पासवर्ड की पुष्टि कीजिये

# REQUEST_EXIST
source: Request already exist.
hi: अनुरोध पहले से ही मौजूद हैं।

# DOB
source: Birthdate
hi: जन्म तिथि

source: SUBMIT
hi: प्रस्तुत करना

# ATTENDANCE_ABSENT_DETAILS
source: Absent Details
hi: अनुपस्थित विवरण

# ATTENDANCE_ABSENT_DETAILS_SUBJECT_NAME
source: Subject
hi: विषय

# ATTENDANCE_ABSENT_DETAILS_TEACHER_NAME
source: Teacher
hi: अध्यापक

# ATTENDANCE_SUBJECTWISE_DETAILS
source: Subject wise Attendance
hi: विषय वार उपस्थिति

# ATTENDANCE_SUBJECTWISE_DETAILS_TOTAL_LECTURE
source: Total Lecture
hi: कुल व्याख्यान

# ATTENDANCE_SUBJECTWISE_DETAILS_PRESENT_LECTURE
source: Present Lecture
hi: व्याख्यान पर उपस्थित

# ATTENDANCE_SUBJECTWISE_DETAILS_ABSENT_LECTURE
source: Absent Lecture
hi: अनुपस्थित व्याख्यान

source: Attendance Chart
hi: उपस्थिति मानचित्र

# CATEGORY
source: Book Category
hi: पुस्तक श्रेणी

source: Book Name
hi: किताब का नाम

source: Publisher
hi: प्रकाशक

source: Accession No
hi: परिग्रहण संख्या

source: Author
hi: लेखक

source: Total Students
hi: कुल छात्रों

source: Present Students
hi: उपस्थित छात्र

source: Absent Students
hi: अनुपस्थित छात्र

source: Lecture Time
hi: व्याख्यान समय

# ASSIGN_HOMEWORK
source: Allot Assignment
hi: निरुपित होमवर्क

source: Total Assign Students
hi: कुल निरुपित छात्रों

source: Total UnAssign Students
hi: कुल अनिर्दिष्ट छात्रों

source: Year
hi: वर्ष

source: Month
hi: महीने

source: Absent
hi: अनुपस्थित

# ONE_FOURTH_DAY
source: 1/4 day
hi: 1/4 दिवस

source: Half day
hi: आधा दिन

# THREE_FOURTH_DAY
source: 3/4 day
hi: 3/4 दिवस

source: Present
hi: वर्तमान

source: Attendance Date
hi: उपस्थितिः तिथि

source: View Assignments
hi: होमवर्क शीर्षक

# VIEW_SUBMITHOMEWORK
source: View Submitted Homework
hi: होमवर्क सूची प्रस्तुत

source: Homework File Upload
hi: होमवर्क फ़ाइल अपलोड करें

# SAVE_ASSIGN_HOMEWORK
source: Save Homework
hi: बचाओ निरुपित होमवर्क

source: Publish Date
hi: प्रकाशित तिथि

source: View Salary Structure
hi: देखें वेतन ढांचे

source: Salary Structure
hi: वेतन ढांचे

source: Salary
hi: वेतन

source: Homework Title
hi: होमवर्क शीर्षक

source: Submit Homework List
hi: होमवर्क सूची प्रस्तुत

# HOMEWORK_ALLOTED_SCUESSFULLY
source: Assignment Allotted Successfully
hi: होमवर्क आवंटित कर दिया

source: Notes
hi: नोट

# SHARE_NOTES
source: Share Notes With Me
hi: शेयर नोट्स

source: Upload Notes
hi: अपलोड नोट

# NOTES_UPLOADED_SCUESSFULLY
source: Notes Upload Successfully
hi: नोट सफलतापूर्वक अपलोड

source: Save Upload Notes
hi: अपलोड नोट

source: Notes Title
hi: नोट शीर्षक

source: Notes Description
hi: नोट विवरण

source: My Report
hi: मेरी रिपोर्ट

source: Report Title
hi: रिपोर्ट का शीर्षक

source: Report Date
hi: रिपोर्ट की तारीख

source: Add Report
hi: जोड़ें रिपोर्

source: Save Report
hi: जोड़ें रिपोर्

# REPORT_UPLOADED_SCUESSFULLY
source: Report Upload Successfully
hi: रिपोर्ट सफलतापूर्वक अपलोड की

source: Submitted date
hi: सबमिट करने की तिथि

source: All Subject
hi: सभी विषय

source: Allot Homework
hi: आवंटित होमवर्क

source: Feed Exam Marks
hi: चारा परीक्षा के निशान

source: Examination
hi: परीक्षा

source: View Homework
hi: देखें होमवर्क

# ASSIGN_HOMEWORKS
source: Assign Homework
hi: निरुपित होमवर्क

source: Exam Category
hi: परीक्षा श्रेणी

source: Select Exam Category
hi: चयन परीक्षा श्रेणी

source: Exam Subject
hi: परीक्षा विषय

source: Select Exam Subject
hi: चयन परीक्षा विषय

source: Add Exam Marks
hi: परीक्षा चिह्न जोड़ें

source: Exam Name
hi: परीक्षाओं के नाम

source: Exam Max Marks
hi: परीक्षा अधिकतम अंक

# SAVE_MARKS
source: Save Exam Marks
hi: मार्क्स

source: Max Marks
hi: अधिकतम अंक

source: Min Marks
hi: न्यूनतम अंक

source: Marks Obtain
hi: प्राप्तांक

source: Save And Next
hi: सहेजें और अगले

# EXAM_PARMA
source: Select Exam Param
hi: परीक्षा PARMA

source: Theory
hi: सिद्धांत

source: Practical
hi: प्रायोगिक

source: All Exam
hi: सब परीक्षा

source: Syllabus Name
hi: सिलेबस का नाम

source: Chapter Name
hi: अध्याय नाम

source: Topic Name
hi: विषय नाम

source: Topic Detail
hi: विषय विस्तार

source: Topic Progress
hi: विषय प्रगति

# MY_HOME
source: Home
hi: घर

source: Requisitions
hi: माँग

# REQUISITIONS_LIST
source: View Requisition
hi: देखें माँग

# CHOOSESTUDENT
source: Select Student
hi: विद्यार्थी चुनें

source: Track Bus
hi: बस पर नज़र रखें

source: Student Id
hi: छात्र आईडी

source: Read more
hi: और पढो

source: Attachment
hi: अटैचमेंट

source: View Request
hi: अनुरोध देखें

source: Enter Username
hi: उपयोगकर्ता नाम दर्ज करें

source: Enter Password
hi: पासवर्ड दर्ज करें

source: About
hi: के बारे में

source: My Hostel
hi: अपने छात्रावास

source: Room Partners
hi: कमरा साथी
